SoCXin/MM32SPIN05/project/Device/MM32SPIN0x_q/Include/MM32SPIN0x_q.h
typedef struct {
    __IO uint32_t KR;
    __IO uint32_t PR;
    __IO uint32_t RLR;
    __IO uint32_t SR;
    __IO uint32_t CTRL;
} IWDG_TypeDef;

/**
* @brief Power Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSR;
} PWR_TypeDef;

/**
* @brief Reset and Clock Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFGR;
    __IO uint32_t CIR;
    __IO uint32_t APB2RSTR;
    __IO uint32_t APB1RSTR;
    __IO uint32_t AHBENR;
    __IO uint32_t APB2ENR;
    __IO uint32_t APB1ENR;
    __IO uint32_t RESERVED9;
    __IO uint32_t CSR;
    __IO uint32_t AHBRSTR;
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t RESERVED4;
    __IO uint32_t RESERVED5;
    __IO uint32_t HSIDLY;
    __IO uint32_t HSEDLY;

} RCC_TypeDef;

/**
* @brief Serial Peripheral Interface
*/

typedef struct {
    __IO uint32_t TXREG;
    __IO uint32_t RXREG;
    __IO uint16_t CSTAT;
    uint16_t RESERVED0;
    __IO uint16_t INTSTAT;
    uint16_t RESERVED1;
    __IO uint16_t INTEN;
    uint16_t RESERVED2;
    __IO uint16_t INTCLR;
    uint16_t RESERVED3;
    __IO uint16_t GCTL;
    uint16_t RESERVED4;
    __IO uint16_t CCTL;
    uint16_t RESERVED5;
    __IO uint16_t SPBRG;
    uint16_t RESERVED6;
    __IO uint16_t RXDNR;
    uint16_t RESERVED7;
    __IO uint16_t NSSR;
    uint16_t RESERVED8;
    __IO uint16_t EXTCTL;
    uint16_t RESERVED9;
} SPI_TypeDef;

/**
* @brief TIM
*/

typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t SMCR;
    __IO uint32_t DIER;
    __IO uint32_t SR;
    __IO uint32_t EGR;
    __IO uint32_t CCMR1;
    __IO uint32_t CCMR2;
    __IO uint32_t CCER;
    __IO uint32_t CNT;
    __IO uint32_t PSC;
    __IO uint32_t ARR;
    __IO uint32_t RCR;
    __IO uint32_t CCR1;
    __IO uint32_t CCR2;
    __IO uint32_t CCR3;
    __IO uint32_t CCR4;
    __IO uint32_t BDTR;
    __IO uint32_t DCR;
    __IO uint32_t DMAR;
    __IO uint32_t OR; /*!< TIM option register,                         Address offset: 0x50 */
    __IO uint32_t CCMR3;
    __IO uint32_t CCR5;
} TIM_TypeDef;

/**
* @brief PWM Registers
*/

typedef struct {
    __IO uint32_t CSR;
    __IO uint32_t APMSKR;
    __IO uint32_t APMDLR;
} PWM_TypeDef;
/**
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/

typedef struct {
    __IO uint32_t TDR;
    __IO uint32_t RDR;
    __IO uint32_t CSR;
    __IO uint32_t ISR;
    __IO uint32_t IER;
    __IO uint32_t ICR;
    __IO uint32_t GCR;
    __IO uint32_t CCR;
    __IO uint32_t BRR;
    __IO uint32_t FRA;
    __IO uint32_t RXADD;
    __IO uint32_t RXMASK;
    __IO uint32_t SCR;
} UART_TypeDef;

/**
* @brief Window WATCHDOG
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFR;
    __IO uint32_t SR;
} WWDG_TypeDef;

/**
* @brief Divider
*/

typedef struct {
    __IO uint32_t DVD;
    __IO uint32_t DVS;
    __IO uint32_t QUOT;
    __IO uint32_t RMD;
    __IO uint32_t STATUS;
    __IO uint32_t DIVCON;
} DIVIDER_TypeDef;
/**
* @brief Analog Comparators
*/

typedef struct {
    __IO uint32_t COMP1_CSR;  //0x00 /*!< Comparator control Status register, Address offset: 0x00 */
    __IO uint32_t RESERVED0;  //0x04
    __IO uint32_t RESERVED1;  //0x08
    __IO uint32_t RESERVED2;  //0x0C
    __IO uint32_t RESERVED3;  //0x10
    __IO uint32_t RESERVED4;  //0x14
    __IO uint32_t COMP_CRV;   //0x18
    __IO uint32_t COMP1_POLL; //0x1C
    __IO uint32_t RESERVED5;  //0x20
} COMP_TypeDef;
/**
* @}
*/
#define HSI_Value_Pll_OFF    ((uint32_t)48000000/6) /*!< Value of the Internal oscillator in Hz*/
#define BKP_BASE              (APB1PERIPH_BASE + 0x2800)
#define HDIV_BASE							(0x40030000)
#define HDIV 								((HDIV_TypeDef *) HDIV_BASE)
typedef struct
{
	__IO uint32_t DVDR;
	__IO uint32_t DVSR;
	__IO uint32_t QUOTR;
	__IO uint32_t RMDR;
	__IO uint32_t SR;
	__IO uint32_t CR;
	
} HDIV_TypeDef;
/** @addtogroup Peripheral_memory_map
* @{
*/

#define FLASH_BASE            ((uint32_t)0x08000000) /*!< FLASH base address in the alias region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the alias region */
#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the alias region */

#define SRAM_BASE             ((uint32_t)0x20000000) /*!< Peripheral base address in the bit-band region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< SRAM base address in the bit-band region */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APBPERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)

#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)


#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)

#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)

#define UART2_BASE            (APB1PERIPH_BASE + 0x4400)

#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)

#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)

#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)

#define GPIOA_BASE            (0x48000000)
#define GPIOB_BASE            (0x48000400)
#define GPIOC_BASE            (0x48000800)
#define GPIOD_BASE            (0x48000C00)

#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400)

#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)

#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)
#define UART1_BASE            (APB2PERIPH_BASE + 0x3800)
#define COMP_BASE             (APB2PERIPH_BASE + 0x3C00)
#define COMP1_BASE            (COMP_BASE + 0x0000)
#define DIVIDER_BASE          (0x40030000)
#define TIM14_BASE            (APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x4800)


#define DMA1_BASE             (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE    (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE    (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE    (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE    (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE    (AHBPERIPH_BASE + 0x0058)


#define RCC_BASE              (AHBPERIPH_BASE + 0x1000)


#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define CRC_BASE              (AHBPERIPH_BASE + 0x3000)

