SoCXin/MM32SPIN05/project/Device/MM32SPIN0x_q/Include/MM32SPIN0x_q.h
#define  ADSTA_EXT_VALID_2                    ((uint32_t)0x00000004)               /*!<Bit 2 */
#define  ADSTA_EXT_VALID_3                    ((uint32_t)0x00000008)               /*!<Bit 3 */


#define  ADSTA_EXT_OVERRUN                    ((uint32_t)0x000000F0)               /*!<Overrun flag */

#define  ADSTA_EXT_OVERRUN_2                  ((uint32_t)0x00000040)               /*!<Bit 2 */
#define  ADSTA_EXT_OVERRUN_3                  ((uint32_t)0x00000080)               /*!<Bit 3 */

/******************************************************************************/
/*                                                                            */
/*                                   COMP                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for COMP_CSR register  *******************/
#define COMP_CSR_EN                           ((uint32_t)0x00000001)               /*!<Comparator x enable*/

#define COMP_CSR_MODE                         ((uint32_t)0x0000000C)               /*!<Comparator mode*/
#define COMP_CSR_MODE_0                       ((uint32_t)0x00000004)               /*!<Bit 0*/
#define COMP_CSR_MODE_1                       ((uint32_t)0x00000008)               /*!<Bit 1*/

#define COMP_CSR_MODE_LOWESTPOWER             ((uint32_t)0x00000000)               /*!<Comparator lowest power mode*/
#define COMP_CSR_MODE_LOWPOWER                ((uint32_t)0x00000004)               /*!<Comparator low power mode*/
#define COMP_CSR_MODE_MEDIUMRATE              ((uint32_t)0x00000008)               /*!<Comparator medium rate mode*/
#define COMP_CSR_MODE_HIGHRATE                ((uint32_t)0x0000000C)               /*!<Comparator high rate mode*/

#define COMP_CSR_INM_SEL                      ((uint32_t)0x00000070)               /*!<Comparator x inverting input selection*/
#define COMP_CSR_INM_SEL_0                    ((uint32_t)0x00000010)               /*!<Bit 0*/
#define COMP_CSR_INM_SEL_1                    ((uint32_t)0x00000020)               /*!<Bit 1*/
#define COMP_CSR_INM_SEL_2                    ((uint32_t)0x00000040)               /*!<Bit 2*/

#define COMP_CSR_INM_SEL_VREFINT_1_4          ((uint32_t)0x00000000)               /*!<Vrefint 1/4 as Compx inverting input*/
#define COMP_CSR_INM_SEL_VREFINT_1_2          ((uint32_t)0x00000010)               /*!<Vrefint 1/2 as Compx inverting input*/
#define COMP_CSR_INM_SEL_VREFINT_3_4          ((uint32_t)0x00000020)               /*!<Vrefint 3/4 as Compx inverting input*/
#define COMP_CSR_INM_SEL_VREFINT              ((uint32_t)0x00000030)               /*!<Vrefint 1 as Compx inverting input*/
#define COMP_CSR_INM_SEL_INM4                 ((uint32_t)0x00000040)               /*!<INM4 as Compx inverting input*/
#define COMP_CSR_INM_SEL_INM5                 ((uint32_t)0x00000050)               /*!<INM5 as Compx inverting input*/
#define COMP_CSR_INM_SEL_INM6                 ((uint32_t)0x00000060)               /*!<INM6 as Compx inverting input*/
#define COMP_CSR_INM_SEL_INM7                 ((uint32_t)0x00000070)               /*!<INM7 as Compx inverting input*/

#define COMP_CSR_INP_SEL                      ((uint32_t)0x00000380)               /*!<Comparator x normal phase input selection*/
#define COMP_CSR_INP_SEL_0                    ((uint32_t)0x00000080)               /*!<Bit 0*/
#define COMP_CSR_INP_SEL_1                    ((uint32_t)0x00000100)               /*!<Bit 1*/
#define COMP_CSR_INP_SEL_2                    ((uint32_t)0x00000200)               /*!<Bit 2*/

#define COMP_CSR_INP_SEL_INP0                 ((uint32_t)0x00000000)               /*!<INP0  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP1                 ((uint32_t)0x00000080)               /*!<INP1  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP2                 ((uint32_t)0x00000100)               /*!<INP2  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP3                 ((uint32_t)0x00000180)               /*!<INP3  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP4                 ((uint32_t)0x00000200)               /*!<INP4  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP5                 ((uint32_t)0x00000280)               /*!<INP5  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP6                 ((uint32_t)0x00000300)               /*!<INP6  as Compx normal phase input*/
#define COMP_CSR_INP_SEL_INP7                 ((uint32_t)0x00000380)               /*!<INP7  as Compx normal phase input*/

#define COMP_CSR_OUT_SEL                      ((uint32_t)0x00003C00)               /*!<Comparator x output selection*/
#define COMP_CSR_OUT_SEL_0                    ((uint32_t)0x00000400)               /*!<Bit 0*/
#define COMP_CSR_OUT_SEL_1                    ((uint32_t)0x00000800)               /*!<Bit 1*/
#define COMP_CSR_OUT_SEL_2                    ((uint32_t)0x00001000)               /*!<Bit 2*/
#define COMP_CSR_OUT_SEL_3                    ((uint32_t)0x00002000)               /*!<Bit 3*/

#define COMP_CSR_OUT_SEL_TIMER1_BRAKEINPUT    ((uint32_t)0x00000800)               /*!<Timer1 brake input*/
#define COMP_CSR_OUT_SEL_TIMER1_OCREFCLEAR    ((uint32_t)0x00001800)               /*!<Timer1 ocrefclear input*/
#define COMP_CSR_OUT_SEL_TIMER1_INPUTCAPTURE1 ((uint32_t)0x00001C00)               /*!<Timer1 input capture 1*/
#define COMP_CSR_OUT_SEL_TIMER2_INPUTCAPTURE4 ((uint32_t)0x00004000)               /*!<Timer1 input capture 4*/
#define COMP_CSR_OUT_SEL_TIMER2_OCREFCLEAR    ((uint32_t)0x00004400)               /*!<Timer1 ocrefclear input*/
#define COMP_CSR_OUT_SEL_TIMER3_INPUTCAPTURE1 ((uint32_t)0x00002800)               /*!<Timer1 input capture 1*/
#define COMP_CSR_OUT_SEL_TIMER3_OCREFCLEAR    ((uint32_t)0x00002C00)               /*!<Timer1 ocrefclear input*/

#define COMP_CSR_POL                          ((uint32_t)0x00008000)               /*!<Comparator x output polarity*/

#define COMP_CSR_HYST                         ((uint32_t)0x00030000)               /*!<Comparator x hysteresis*/
#define COMP_CSR_HYST_0                       ((uint32_t)0x00010000)               /*!<Bit 0*/
#define COMP_CSR_HYST_1                       ((uint32_t)0x00020000)               /*!<Bit 1*/

